// uploadQuestions.js
import { db } from "./firebase";
import { collection, setDoc, doc } from "firebase/firestore";

// Масив питань
const questionsHis = [
  {
    id: 1,
    type: "single",
    question:
      "Яку із зображених на фото історичних пам'яток виявлено під час археологічних досліджень кургану Товста Могила?",
    options: [
      {
        id: 1,
        label: "1",
        image: "https://i.postimg.cc/J0fYjzB1/2025-04-30-05-50-29.png",
      },
      {
        id: 2,
        label: "2",
        image: "https://i.postimg.cc/VsJY9ZbT/2025-04-30-05-50-43.png",
      },
      {
        id: 3,
        label: "3",
        image: "https://i.postimg.cc/mgsBsb6f/2025-04-30-05-51-12.png",
      },
      {
        id: 4,
        label: "4",
        image: "https://i.postimg.cc/x8DFzdm9/2025-04-30-05-51-34.png",
      },
    ],
    answer: "4",
  },
  {
    id: 2,
    type: "single",
    question:
      "Що стало поштовхом до описаних у джерелах дій княгині: «Я пішла Ольга по Древлянській землі з сином своїм і дружиною своєю, установлюючи устави й уроки; І донині є становища її і ловища її…»; «Пішла Ольга до Новгорода. І встановила вона... погости й оброки. І ловища її по всій землі, і знаки [її]... і сани її стоять у Пскові й до сьогодні…»?",
    options: [
      { id: 1, label: "загибель київського князя Ігоря" },
      { id: 2, label: "захоплення влади в Києві князем Олегом" },
      { id: 3, label: "невдалий похід князя Святослава на Балкані" },
      {
        id: 4,
        label: "початок систематичних нападів на Русь-Україну печенігів",
      },
    ],
    answer: "загибель київського князя Ігоря",
  },
  {
    id: 3,
    type: "single",
    question:
      "Який термін доречно використовувати, характеризуючи залежність руських князівств від Золотої Орди?",
    options: [
      { id: 1, label: "«ярлик»" },
      { id: 2, label: "«вотчина»" },
      { id: 3, label: "«холоп»" },
      { id: 4, label: "«магдебурзьке право»" },
    ],
    answer: "«ярлик»",
  },
  {
    id: 4,
    type: "single",
    question: "Яка подія відбулася 1569 року?",
    options: [
      {
        id: 1,
        label: "заснування першої Запорозької Січі на о. Мала Хортиця",
      },
      {
        id: 2,
        label:
          "похід козаків під проводом П. Сагайдачного на Московське царство",
      },
      {
        id: 3,
        label:
          "об’єднання Великого князівства Литовського та Королівства Польського",
      },
      {
        id: 4,
        label:
          "укладення козацького реєстру польським королем Стефаном Баторієм",
      },
    ],
    answer:
      "об’єднання Великого князівства Литовського та Королівства Польського",
  },
  {
    id: 5,
    type: "single",
    question:
      "Укажіть мистецьку пам’ятку, що увічнює провідника Національно-визвольної війни українського народу середини ХVІІ ст.",
    options: [
      {
        id: 1,
        label: "1",
        image: "https://i.postimg.cc/kXdgnFBp/2025-04-30-06-13-59.png",
      },
      {
        id: 2,
        label: "2",
        image: "https://i.postimg.cc/dtmtDkCt/2025-04-30-06-14-15.png",
      },
      {
        id: 3,
        label: "3",
        image: "https://i.postimg.cc/L8x9Bcvc/2025-04-30-06-14-47.png",
      },
      {
        id: 4,
        label: "4",
        image: "https://i.postimg.cc/9fScsy61/2025-04-30-06-14-59.png",
      },
    ],
    answer: "2",
  },
  {
    id: 6,
    type: "single",
    question:
      "Автором цитованого документа «…Договори наші… уклав я з Королем Шведським письмовим актом, підписаним з обох сторін… І тепер ми вважати повинні Шведів за своїх приятелів, союзників, добродіїв і немовби од Бога посланих, щоб увільнити нас від рабства… Відомо ж бо, що колись були ми ті, що тепер московці: уряд, первинність і сама назва Русь од нас до них перейшли…» був",
    options: [
      {
        id: 1,
        label: "П. Сагайдачний",
      },
      {
        id: 2,
        label: "І. Виговський",
      },
      {
        id: 3,
        label: "І. Самойлович",
      },
      {
        id: 4,
        label: "І. Мазепа",
      },
    ],
    answer: "І. Мазепа",
  },
  {
    id: 6,
    type: "single",
    question:
      "Автором цитованого документа «…Договори наші… уклав я з Королем Шведським письмовим актом, підписаним з обох сторін… І тепер ми вважати повинні Шведів за своїх приятелів, союзників, добродіїв і немовби од Бога посланих, щоб увільнити нас від рабства… Відомо ж бо, що колись були ми ті, що тепер московці: уряд, первинність і сама назва Русь од нас до них перейшли…» був",
    options: [
      {
        id: 1,
        label: "П. Сагайдачний",
      },
      {
        id: 2,
        label: "І. Виговський",
      },
      {
        id: 3,
        label: "І. Самойлович",
      },
      {
        id: 4,
        label: "І. Мазепа",
      },
    ],
    answer: "І. Мазепа",
  },
  {
    id: 7,
    type: "single",
    question:
      "«Запорозькі козаки, – писав 1776 р. старшина В. Чернявський, – мають деякі поселення, де тримають худобу, коней й овець, мають пасіки, розводять сади й городи, роблять запаси сіна та худоби й засівають поля різним хлібом, ловлять звіра, а в річках – рибу». Як козаки називали такі «поселення»?",
    options: [
      { id: 1, label: "зимівники" },
      { id: 2, label: "паланки" },
      { id: 3, label: "повіти" },
      { id: 4, label: "курені" },
    ],
    answer: "зимівники",
  },
  {
    id: 8,
    type: "single",
    question:
      "Коли на українських землях було засновано університет, якому імперська влада ставила завдання «поширювати російську освіту й російську національність в ополяченому краю Західної Росії...»?",
    options: [
      { id: 1, label: "1805 р." },
      { id: 2, label: "1834 р." },
      { id: 3, label: "1865 р." },
      { id: 4, label: "1875 р." },
    ],
    answer: "1834 р.",
  },
  {
    id: 9,
    type: "single",
    question:
      "Кого із суспільно-політичних діячів називали «двічі арештованим», «буковинським королем», «народним послом до Відня»?",
    options: [
      { id: 1, label: "О. Довбуша" },
      { id: 2, label: "У. Кармалюка" },
      { id: 3, label: "І. Вагилевича" },
      { id: 4, label: "Л. Кобилицю" },
    ],
    answer: "Л. Кобилицю",
  },
  {
    id: 10,
    type: "single",
    question:
      "Якою цифрою на картосхемі позначено регіон товарного виробництва цукру наприкінці ХІХ – на початку ХХ ст.?",
    image: "https://i.postimg.cc/59r8prKF/2025-04-30-06-29-06.png",
    options: [
      { id: 1, label: "1" },
      { id: 2, label: "2" },
      { id: 3, label: "3" },
      { id: 4, label: "4" },
    ],
    answer: "2",
  },
  {
    id: 11,
    type: "single",
    question:
      "Боротьба за український університет стала важливим питанням політичної боротьби наприкінці ХІХ – на початку ХХ ст. для",
    options: [
      { id: 1, label: "Поділля" },
      { id: 2, label: "Східної Галичини" },
      { id: 3, label: "Північної Буковини" },
      { id: 4, label: "Закарпаття" },
    ],
    answer: "Східної Галичини",
  },
  {
    id: 12,
    type: "single",
    question:
      "Які однакові дії під час Першої світової війни застосовували російська та австрійська влади стосовно українських земель, що входили до складу Австро-Угорщини?",
    options: [
      { id: 1, label: "заборона діяльності українських політичних партій" },
      { id: 2, label: "тотальна мобілізація чоловічого населення до армії" },
      { id: 3, label: "депортація нелояльної частини населення" },
      { id: 4, label: "боротьба з греко-католицькою церквою" },
    ],
    answer: "депортація нелояльної частини населення",
  },
  {
    id: 13,
    type: "single",
    question:
      "Укажіть фото діяча, який 1917 р. активно пропагував українізацію частин російської армії.",
    options: [
      {
        id: 1,
        label: "1",
        image: "https://i.postimg.cc/wvL3VW1D/2025-04-30-06-36-46.png",
      },
      {
        id: 2,
        label: "2",
        image: "https://i.postimg.cc/L5V5dnBX/2025-04-30-06-37-01.png",
      },
      {
        id: 3,
        label: "3",
        image: "https://i.postimg.cc/g2jJ5cwz/2025-04-30-06-37-44.png",
      },
      {
        id: 4,
        label: "4",
        image: "https://i.postimg.cc/W1y3PRrM/2025-04-30-06-37-55.png",
      },
    ],
    answer: "2",
  },
  {
    id: 14,
    type: "single",
    question:
      "Провал планів партійно-радянського керівництва СРСР із хлібозаготівлі в Українській СРР 1932 р. призвів до запровадження на селі",
    options: [
      { id: 1, label: "терору голодом" },
      { id: 2, label: "системи раднаргоспів" },
      { id: 3, label: "кампанії з розкуркулення" },
      { id: 4, label: "заходів зі згортання колективізації" },
    ],
    answer: "терору голодом",
  },
  {
    id: 15,
    type: "single",
    question:
      "Ідеологічні гасла якої політичної сили відображено на плакаті й транспаранті?",
    image: "https://i.postimg.cc/xTWhrt8X/2025-04-30-06-47-07.png",
    options: [
      { id: 1, label: "Української національної партії (УНП)" },
      { id: 2, label: "Організації українських націоналістів (ОУН)" },
      { id: 3, label: "Комуністичної партії Західної України (КПЗУ)" },
      {
        id: 4,
        label: "Українського національно-демократичного об’єднання (УНДО)",
      },
    ],
    answer: "Організації українських націоналістів (ОУН)",
  },
  {
    id: 16,
    type: "single",
    question:
      "Прочитайте уривок документа: «Підготовча робота до евакуації та сама евакуація в’язниць у західних областях України розпочалася з 22 червня цього року. У чотирьох тюрмах утримували 5424 в’язні. У перший же день уторгнення німців в СРСР у тюрмах було виконано вироки щодо 108 в’язнів…» В’язні, про яких ідеться в уривку джерела, потрапляли до тюрем у результаті проведення",
    options: [
      { id: 1, label: "акції «пацифікації»" },
      { id: 2, label: "політики «осадництва»" },
      { id: 3, label: "режиму «нового порядку»" },
      { id: 4, label: "політики «радянізації»" },
    ],
    answer: "політики «радянізації»",
  },
  {
    id: 17,
    type: "single",
    question:
      "Коли відбулася подія, у результаті якої польська влада планувала здійснити поставлені завдання: «1. Залучити робочу силу для господарювання “повернутих земель”; 2. Остаточно підірвати життєву базу ОУН й УПА; 3. Асимілювати окремі родини етнічних українців у суцільній масі польського населення...»?",
    options: [
      { id: 1, label: "1944 р." },
      { id: 2, label: "1945 р." },
      { id: 3, label: "1946 р." },
      { id: 4, label: "1947 р." },
    ],
    answer: "1947 р.",
  },
  {
    id: 18,
    type: "single",
    question:
      "«…Завдання семирічки в галузі сільського господарства ми зможемо виконати за п’ять років… Розрахунки показують, що посіви кукурудзи мають орієнтовно складати 9–10 млн га і дорівнювати приблизно половині всієї площі зернових…» Наведений уривок документа є свідченням реалізації",
    options: [
      { id: 1, label: "планів повоєнної відбудови України" },
      { id: 2, label: "однієї з надпрограм М. Хрущова" },
      { id: 3, label: "заходів реформ О. Косигіна" },
      { id: 4, label: "Продовольчої програми" },
    ],
    answer: "однієї з надпрограм М. Хрущова",
  },
  {
    id: 19,
    type: "single",
    question:
      "Що призвело до виникнення в УРСР явища, на якому акцентує увагу карикатура?",
    image: "https://i.postimg.cc/pVKqhRLL/2025-04-30-06-51-33.png",
    options: [
      {
        id: 1,
        label:
          "тотальний дефіцит товарів широкого вжитку в торговельній мережі",
      },
      {
        id: 2,
        label:
          "директивне планування виробництва, розподілу й споживання товарів",
      },
      { id: 3, label: "низький рівень культури обслуговування покупців" },
      {
        id: 4,
        label: "постійне зростання цін у державних закладах торгівлі",
      },
    ],
    answer: "директивне планування виробництва, розподілу й споживання товарів",
  },
  {
    id: 20,
    type: "single",
    question:
      "Яке поняття треба використати, визначаючи головну ідею карикатури?",
    image: "https://i.postimg.cc/cLkmyJXX/2025-04-30-06-52-09.png",
    options: [
      { id: 1, label: "«геноцид»" },
      { id: 2, label: "«шовінізм»" },
      { id: 3, label: "«колоніалізм»" },
      { id: 4, label: "«анексія»" },
    ],
    answer: "«анексія»",
  },
  {
    id: 21,
    type: "matching",
    question:
      "Узгодьте подію Національно-визвольної війни українського народу середини XVII ст. з роком, коли вона відбувалася.",
    pairs: {
      left: [
        "1. Жванецька облога",
        "2. Зборівська битва",
        "3. Берестецька битва",
        "4. Жовтоводська битва",
      ],
      right: [
        "А. 1648 р.",
        "Б. 1649 р.",
        "В. 1651 р.",
        "Г. 1652 р.",
        "Д. 1653 р.",
      ],
    },
    answer: {
      1: "Д",
      2: "Б",
      3: "В",
      4: "А",
    },
  },
  {
    id: 22,
    type: "matching",
    question: "Доберіть до кожного з видань його характеристику.",
    pairs: {
      left: [
        "1. «Енеїда»",
        "2. «Історія Русів»",
        "3. «Основа»",
        "4. «Громада»",
      ],
      right: [
        "А. перший український суспільно-політичний і літературно-мистецький журнал, що видавала українська громада 1861–1862 рр. у Петербурзі",
        "Б. український громадсько-політичний і науково-літературний збірник, що видавав у Женеві Михайло Драгоманов у період 1878–1879 рр. та 1882 р.",
        "В. одна з визначних пам’яток української історичної та суспільно-політичної думки другої половини XVIII – початку XIX ст., у якій обстоювано ідею автономного державного розвитку України",
        "Г. перший твір нової української літератури, надрукований у Санкт-Петербурзі 1798 р.",
        "Д. щомісячний історико-етнографічний і літературний часопис, що видавали в Києві російською й українською мовами протягом 1882–1906 рр.",
      ],
    },
    answer: {
      1: "Г",
      2: "В",
      3: "А",
      4: "Б",
    },
  },
  {
    id: 23,
    type: "matching",
    question:
      "Узгодьте ім’я історичної особи (постаті) з фактами її біографії.",
    pairs: {
      left: [
        "1. Кость Левицький",
        "2. Дмитро Донцов",
        "3. Євген Коновалець",
        "4. Андрій Жук",
      ],
      right: [
        "А. співзасновник Української національно-демократичної партії, голова Державного секретаріату ЗУНР",
        "Б. учасник боїв за гору Маківка, командир Галицько-Буковинського куреня січових стрільців",
        "В. член Головної української ради, Загальної української ради, дипломат Української Держави, УНР",
        "Г. співзасновник і голова Української національної партії на Буковині, Голова української національної громади в Румунії",
        "Д. голова Союзу визволення України, теоретик та ідеолог українського націоналізму",
      ],
    },
    answer: {
      1: "А",
      2: "Д",
      3: "Б",
      4: "В",
    },
  },
  {
    id: 24,
    type: "matching",
    question:
      "Узгодьте описане явище соціально-економічного життя з періодом історії України, для якого воно було характерним.",
    pairs: {
      left: [
        "1. «Успішний розвиток України та збільшення національного багатства потребують тісної взаємодії держави й національного бізнесу. Потрібно більшу частину товарів, що їх використовують в Україні, виробляти всередині країни...»",
        "2. «Прискорення соціально-економічного розвитку насамперед визначено необхідністю в перебудові структурної політики, форм і методів управління…»",
        "3. «...Ми хотіли, щоб нам дали картки із централізованим забезпеченням населення якоюсь кількістю продуктів й організацію харчування тих, хто голодує...»",
        "4. «Основна частина підприємств місцевого значення перейшла з підпорядкування союзних міністерств у підпорядкування обласних рад депутатів…»",
      ],
      right: [
        "А. Україна в перші повоєнні роки (1945 – початок 1950-х рр.)",
        "Б. Україна в умовах десталінізації (1953–1964 рр.)",
        "В. Україна в період загострення кризи радянської системи (1965 – перша половина 1980-х рр.)",
        "Г. Відновлення незалежності України (1985–1991 рр.)",
        "Д. Творення нової України (початок ХХІ ст. – сьогодення)",
      ],
    },
    answer: {
      1: "Д",
      2: "Г",
      3: "А",
      4: "Б",
    },
  },
  {
    id: 25,
    type: "matching",
    question:
      "Розташуйте події в хронологічній послідовності. Цифрі 1 має відповідати вибрана Вами перша подія, цифрі 2 – друга, цифрі 3 – третя, цифрі 4 – четверта. Установіть послідовність подій, описаних в уривках історичних джерел.",
    pairs: {
      left: [
        "1. Перша подія",
        "2. Друга подія",
        "3. Третя подія",
        "4. Четверта подія",
      ],
      right: [
        "А. «Прийшли іноплемінники на Руську землю, половці многі...» (битва на р. Альт)",
        "Б. «У той же час поїхав був Данило в Угри до короля...» (татарське нашестя)",
        "В. «І говорили [половці] руським князям: “Якщо ви не поможете нам...”» (перша зустріч із половцями)",
        "Г. «Прибули Святополк [Ізяславич], і Володимир [Всеволодович]...» (Любецький з’їзд)",
      ],
    },
    answer: {
      1: "А",
      2: "Г",
      3: "В",
      4: "Б",
    },
  },
  {
    id: 26,
    type: "matching",
    question:
      "Розташуйте події в хронологічній послідовності. Цифрі 1 має відповідати вибрана Вами перша подія, цифрі 2 – друга, цифрі 3 – третя, цифрі 4 – четверта. Установіть послідовність подій часів Другої світової війни, по гаслам на радянських плакатах.",
    pairs: {
      left: [
        "1. Перша подія",
        "2. Друга подія",
        "3. Третя подія",
        "4. Четверта подія",
      ],
      right: [
        "А. Подати руку допомоги братнім народам Західної України й Західної Білорусії – наш священний обов’язок!",
        "Б. ХАРКІВ РАДЯНСЬКИЙ! ХАРКІВ НАШ – УКРАЇНСЬКИЙ! ОБНІМІТЬСЯ, БРАТИ-УКРАЇНЦІ, В ДЕНЬ ВЕЛИКОГО СВЯТА!",
        "В. УКРАЇНА ВІЛЬНА!",
        "Г. НЕЩАДНО РОЗІБ’ЄМО ТА ЗНИЩИМО ВОРОГА!",
      ],
    },
    answer: {
      1: "А",
      2: "Г",
      3: "Б",
      4: "В",
    },
  },
  {
    id: 27,
    type: "matching",
    question:
      "Розташуйте події в хронологічній послідовності. Цифрі 1 має відповідати вибрана Вами перша подія, цифрі 2 – друга, цифрі 3 – третя, цифрі 4 – четверта. Установіть послідовність подій періоду творення нової України.",
    pairs: {
      left: [
        "1. Перша подія",
        "2. Друга подія",
        "3. Третя подія",
        "4. Четверта подія",
      ],
      right: [
        "А. початок Євромайдану",
        "Б. вступ України до Світової організації торгівлі (СОТ)",
        "В. укладення Мінських домовленостей",
        "Г. підписання Україною Угоди про асоціацію з Європейським Союзом (ЄС)",
      ],
    },
    answer: {
      1: "Б",
      2: "А",
      3: "Г",
      4: "В",
    },
  },
  {
    id: 28,
    type: "matching",
    question: "Визначте умови Білоцерківського договору 1651 р.",
    pairs: {
      left: ["1", "2", "3"],
      right: [
        "А. дозвіл короля на залучення ханом «для допомоги» Війська Запорозького",
        "Б. отримання шляхтою дозволу повернутися до своїх маєтків, зокрема до розміщених на козацьких територіях",
        "В. виплата Гетьманщиною певної суми коштів до московської скарбниці",
        "Г. обмеження чисельності козацького реєстрового війська 40 тис. осіб",
        "Д. визнання козацькими територіями лише земель Київського воєводства",
        "Е. скасування «на вічні часи» посади гетьмана",
        "Є. позбавлення гетьмана права дипломатичних зносин з іноземними державами",
      ],
    },
    answer: {
      1: "Б",
      2: "Д",
      3: "Є",
    },
  },
  {
    id: 29,
    type: "matching",
    question:
      "Що стало результатом подій Другої світової війни, відображених на картосхемі?",
    image: "https://i.postimg.cc/9XSwh7h4/2025-04-30-07-34-15.png",
    pairs: {
      left: ["1", "2", "3"],
      right: [
        "А. утворення Червоною армією плацдармів на правому березі Дніпра",
        "Б. вигнання німецьких окупантів із Донбасу",
        "В. депортація кримських татар та інших народів Криму",
        "Г. проголошення Акта відновлення Української держави",
        "Д. створення Української повстанської армії (УПА)",
        "Е. початок діяльності похідних груп ОУН",
        "Є. поява в лавах Червоної армії піхотних підрозділів, укомплектованих «чорносвитниками»",
      ],
    },
    answer: {
      1: "А",
      2: "Б",
      3: "Є",
    },
  },
  {
    id: 30,
    type: "matching",
    question:
      "Які держави, крім України, входили до «нормандської четвірки» – формату переговорів для розв’язання російсько-українського збройного конфлікту?",
    pairs: {
      left: ["1", "2", "3"],
      right: [
        "А. Росія",
        "Б. США",
        "В. Італія",
        "Г. Китай",
        "Д. Велика Британія",
        "Е. Франція",
        "Є. Німеччина",
      ],
    },
    answer: {
      1: "А",
      2: "Е",
      3: "Є",
    },
  },
];

export const uploadQuestionsHis = async () => {
  const questionsRef = collection(db, "questionsHis");

  // Завантажуємо кожне питання в Firebase
  for (let question of questionsHis) {
    await setDoc(doc(questionsRef, question.id.toString()), question);
  }

  console.log("Усі питання завантажено до Firestore ✅");
};
